/*
Navicat MySQL Data Transfer

Source Server         : super
Source Server Version : 50162
Source Host           : localhost:3306
Source Database       : firstsight

Target Server Type    : MYSQL
Target Server Version : 50162
File Encoding         : 65001

Date: 2019-01-04 14:21:04
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `fs_flower`
-- ----------------------------
DROP TABLE IF EXISTS `fs_flower`;
CREATE TABLE `fs_flower` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '鲜花ID',
  `kind` int(11) NOT NULL COMMENT '外键：fs_kind.id类别号',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '商品名',
  `nameDisc` varchar(30) COLLATE utf8_unicode_ci NOT NULL COMMENT '宣传语',
  `price` int(5) NOT NULL COMMENT '价格',
  `code` varchar(10) COLLATE utf8_unicode_ci NOT NULL COMMENT '商品编号，唯一',
  `material` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '材料',
  `wrap` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '包装',
  `word` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '花语',
  `attached` varchar(30) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT '赠品',
  `area` varchar(20) COLLATE utf8_unicode_ci DEFAULT '全国' COMMENT '配送范围，默认全国',
  `discount` int(2) DEFAULT NULL COMMENT '折扣',
  `picture` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '展示图路径1张',
  `detail` text COLLATE utf8_unicode_ci NOT NULL COMMENT '商品详细图，以##分隔',
  `sales` int(10) DEFAULT '0' COMMENT '销量',
  `crtTime` date NOT NULL COMMENT '录入日期',
  `crtBy` int(11) NOT NULL COMMENT '录入人',
  `mdfTime` datetime DEFAULT NULL COMMENT '修改时间',
  `mdfBy` int(11) DEFAULT NULL COMMENT '修改人',
  PRIMARY KEY (`id`),
  UNIQUE KEY `code` (`code`),
  KEY `kind` (`kind`),
  CONSTRAINT `fs_flower_ibfk_1` FOREIGN KEY (`kind`) REFERENCES `fs_kind` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10065 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of fs_flower
-- ----------------------------
INSERT INTO `fs_flower` VALUES ('10000', '10000', '忘情巴黎', '浪漫唯美 女神挚爱', '298', '9012009', '33枝红玫瑰，石竹梅围绕', '黑色条纹纸，红色缎带花结', '只想和你忘掉一切烦恼，尽情沉醉在最浪漫的气氛中。', '免费赠送精美贺卡！', '全国', null, '9012009.jpg', 'by_20180611134635481.jpg##by_20180702095709936.jpg##2015420174953899997.jpg##20151223184607197772.jpg##20151223184694302325.jpg##2015420175007241855.jpg##by_20180719135050502.jpg##xianhua_cardstyle.jpg', '3', '2018-12-29', '10000', null, null);
INSERT INTO `fs_flower` VALUES ('10001', '10000', '珍爱如初', '高档礼盒 纯洁高贵', '206', '9010947', '雪山玫瑰11枝、深紫色勿忘我0.3扎', '素染纸-浅灰2张，雪梨纸0.5张，银灰色logo缎带1米，魔力铁山灰盒(小)', '用一袭白裙装扮你那无瑕的身姿，向一抹白云倾诉对你的思念，用一捧鲜花证明我不变的心。', '免费赠送精美贺卡！', '全国', null, '9010947.jpg', '201707281816447131739329.jpg##201707281816447261516547.jpg##201707281816447676353036.jpg##201707281816447776633524.jpg##201707281816451893232443.jpg##201784145418818286.jpg##201707281816452242993101.jpg##201707281816452312928420.jpg##201707281816462195946990.jpg##201707281816462565695378.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10002', '10000', '恋恋情深', '经典款式 简约设计', '199', '9012243', '11枝香槟玫瑰，白百合2枝，栀子叶0.5扎', '深浅绿双面人造纸2张，米白色缎带1.5米', '喜欢像是一阵风，而爱你是细水长流', '免费赠送精美贺卡！', '全国', null, '9012243.jpg_220x240.jpg', '20170822191235347.jpg##20170822191236172.jpg##20170828115945157.jpg##by_20180703184222909.jpg##20170822191237431.jpg##20170822191238377.jpg##20170822191238939.jpg##20170822191239839.jpg##20170822191240210.jpg##20170822191241840.jpg##20171220163103677.jpg##20170822191243417.jpg##20170822191244417.jpg##xianhua_cardstyle.jpg', '1', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10003', '10000', '一往情深', '经典爆款，年销售冠军！', '245', '9010966', '19枝红玫瑰，勿忘我适量', '牛皮纸和深咖啡色条纹纸，银色缎带花结，魔力铁山灰包装盒', '你的轻柔像阵微风，让我从容不迫，想让你知道，我对你始终一往情深。', '免费赠送精美贺卡！', '全国', null, '9010966.jpg_220x240.jpg', 'by_20180615112041289.jpg##by_20180615112041289.jpg##by_2018061511132044.jpg##by_20180615111320443.jpg##by_201806151113212.jpg##by_20180615111321943.jpg##by_20180615111322546.jpg##by_20180615111323757.jpg##by_20180719134122599.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10004', '10000', '你的香气', '高端鲜花', '128', '9012078', '黛安娜玫瑰9枝，浅紫色勿忘我适量，栀子叶适量', '白色雪梨纸，浅紫／香芋紫人造纸，豆沙色缎带花结', '花开的季节，我迷恋你的香气，那是我思念的味道！', '免费赠送精美贺卡！', '全国', '8', '9012078.jpg', 'by_20180611163400921.jpg##by_20180629161207395.jpg##2017471318363721286.jpg##2017471318411266253.jpg##2017471319177740359.jpg##by_20180719143427875.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10005', '10000', '不变的承诺', '经典99枝，鼎力推荐！', '520', '9012177', '99枝红玫瑰', '黑色雪梨纸，黑色条纹纸，玻璃纸卷，酒红色缎带花结', '爱她，就送她一束99枝的玫瑰花！', '免费赠送精美贺卡！', '全国', null, '9012177.jpg_220x240.jpg', '201708111126113526406778.jpg##201708111126113645949118.jpg##20178111731418207965.jpg##by_20180703175901652.jpg##201708111126115465741705.jpg##201708111126115565531573.jpg##201708111126116449249498.jpg##201708111126117359896636.jpg##201708111126121584402853.jpg##201708111126123890710878.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10006', '10000', '爱的小确幸', '玫瑰平铺设计', '309', '9012167', '戴安娜粉玫瑰21枝，粉色桔梗5枝，石竹梅7枝', '57#魔力铁山灰包装盒', '一个人有一种幸福，爱是最简单的音符，啦啦啦~微小确定的幸福！', '免费赠送精美贺卡！', '全国', null, '9012167.jpg', '201727175748178027.jpg##by_20180702162929663.jpg##201727175723183963.jpg##20173141334282328219.jpg##20172241729227013202.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10007', '10000', '不变的心', '精品鲜花', '459', '9012055', '戴安娜玫瑰66枝 勿忘我适量围绕', '内层粉色厚棉纸 外层银灰色短平板印花树叶草 粉紫双色缎带', '没有你，我就像一只迷失了方向的船。', '免费赠送精美贺卡！', '全国', null, '9012055.jpg', 'by_20180611153156715.jpg##by_20180702105348185.jpg##2015119153593973559.jpg##2015119153513464526.jpg##by_20180719141049209.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10008', '10000', '炙热（复古网纱款）', '网红爆款', '529', '9012335', '红玫瑰99枝', '黑色条纹纸4张,黑色雪梨纸4张.黑纱4米，红色缎带4米', '想说的话可以说一半 但爱一个人的炙热 一点儿也藏不住', '免费赠送精美贺卡！', '全国', null, '9012335.jpg_220x240.jpg', 'by_20180910150057793.jpg##by_20180910150057977.jpg##by_20180910150058120.jpg##by_20180910150058228.jpg##by_20180910152726551.jpg##by_20180910150058511.jpg##by_20180910150058716.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10009', '10000', '爱的礼物', '圣诞节新品', '228', '9012380', '卡罗拉红玫瑰9枝，白色紫罗兰5支，红色洋牡丹5枝，银叶菊2支，白色石竹梅3枝', '青灰双面牛皮纸6张，红色缎带2米', '每一次的庆祝，都是发自内心的祝福。每一次的礼物，都是精挑细选的心意！', '免费赠送精美贺卡！', '全国', null, '9012380.jpg', 'by_20181204150911899.jpg##by_2018120415091295.jpg##by_20181204150912256.jpg##by_20181204150912423.jpg##by_20181204150912571.jpg##by_20181204150912692.jpg##by_20181204150912831.jpg##by_20181204150912960.jpg##by_2018120415091398.jpg##by_20181204150913360.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10010', '10000', '邂逅你的美', '新品上新', '188', '9012376', '白玫瑰9枝，橙色多头玫6枝，尤加利叶适量', '虾粉双面牛皮纸2米，米色缎带2米', '想和你在阳光的午后赏花喝茶，想和你在落日的傍晚谈天说地，用这一束灿烂温暖你的圣诞！', '免费赠送精美贺卡！', '全国', '9', '9012376.jpg_220x240.jpg', 'by_20181121170858630.jpg##by_20181121170858830.jpg##by_20181121170858972.jpg##by_20181121170859167.jpg##by_20181121170859365.jpg##by_20181121170859494.jpg##by_20181121170859702.jpg##by_20181121170859895.jpg##by_2018112117090033.jpg##by_20181121170900431.jpg##by_2018120518023122.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10011', '10000', '我只钟情你', '错落有致 甜蜜纯洁', '239', '9012223', '香槟玫瑰11枝、白色小雏菊3枝、浅紫色勿忘我4枝、栀子叶2枝', '米白色平面纸1张、蓝色条纹纸1张、米白色缎带1米、60#大号魔力铁山灰包装盒', '香槟玫瑰清新、脱俗，品位独特！让我们乘着芬芳的清风，手牵着手走过四季春秋。', '免费赠送精美贺卡！', '全国', null, '9012223.jpg', '201708161149170198353497.jpg##201708161149170338704794.jpg##201708161149171299534169.jpg##by_20180703185536865.jpg##201708161149173776833592.jpg##201708161149173978504631.jpg##201708161149174708185998.jpg##201708161149175908473139.jpg##201708161149180409172004.jpg##201708161149180728743815.jpg##2017816141802009478.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10012', '10000', '阳光海岸', '98%好评率，热销推荐', '228', '9012011', '19枝香槟玫瑰，白色石竹梅围绕', '英文纸，咖啡色缎带花结', '你手牵手漫步海边，在沙滩上画两颗心，心心相印，永不分离。', '免费赠送精美贺卡！', '全国', null, '9012011.jpg', 'by_20180611142142453.jpg##by_20180702100036904.jpg##20154201839168117602.jpg##20151223182701102008.jpg##20154201839216111499.jpg##by_2018071913531135.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10013', '10000', '爱的喜悦', '创意新品特价', '269', '9012365', '粉佳人玫瑰9枝，粉桔梗0.7扎，香槟桔梗0.3扎，粉小菊0.5扎，南天竹叶适量', '爱心型金属花篮', '爱与幸福，只为传递爱的喜悦！', '免费赠送精美贺卡！', '全国', '9', '9012365.jpg_220x240.jpg', 'by_20181119115017872.jpg##by_2018111911501831.jpg##by_20181119115018225.jpg##by_20181119115018361.jpg##by_20181119115018547.jpg##by_20181119115018900.jpg##by_2018111911501964.jpg##by_20181119115019410.jpg##xianhua_cardstyle.jpg', '2', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10014', '10000', '最初的心动', '新品上新', '166', '9012377', '白玫瑰9枝，尤加利果0.3扎，银叶菊0.5扎', '蓝色绝色纸3张，米色缎带2米', '还记得遇见你那最初的心动，看遍繁华种种，你依然与众不同！', '免费赠送精美贺卡！', '全国', null, '9012377.jpg_220x240.jpg', 'by_20181121171133940.jpg##by_20181121171134134.jpg##by_20181121171134331.jpg##by_20181121171134533.jpg##by_20181121171135353.jpg##by_20181121171135531.jpg##by_20181121171135747.jpg##by_20181121171135940.jpg##by_20181121171136140.jpg##by_20181121171136467.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10015', '10000', '天使的心跳', '渐变颜色，淡淡甜香气味', '226', '9012030', '粉佳人粉玫瑰19枝，粉色桔梗6枝', '内层深咖啡平面牛油纸，外层浅粉色短平板，紫色缎带花结', '你就是我的天使，带给我快乐的天使，你的心跳牵动着我的每一次呼吸。', '免费赠送精美贺卡！', '全国', null, '9012030.jpg', 'by_20180611143743296.jpg##by_20180702100944127.jpg##201568175835578799.jpg##201568175884445010.jpg##by_20180719135822136.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10016', '10001', '圆满', '点滴真情，花香传递', '286', '9010766', '粉百合2枝、红玫瑰9枝、叶上花1扎、红色康乃馨15枝、粉色洋桔梗0.5扎', '有柄花篮一个', '载着寓意希望的鲜花驶向快乐幸福的彼岸…… ', '免费赠送精美贺卡！', '全国', null, '9010766.jpg_220x240.jpg', 'by_20180619100706846.jpg##by_20180619100707499.jpg##by_20180619100708169.jpg##by_2018061910070921.jpg##by_20180619100709641.jpg##by_2018061913394647.jpg##by_20180619100711223.jpg##by_20180619100712714.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10017', '10001', '留住好时光', '精致生活好伴侣', '239', '9012332', '粉绣球1枝，粉雪山玫瑰6枝，粉桔梗0.3扎，栀子叶0.5扎', '长方形手提花篮1个', '让每点阳光，洒于你脸庞；令你的微笑，比花更盛放！', '免费赠送精美贺卡！', '全国', null, '9012332.jpg_220x240.jpg', 'by_20180906145812910.jpg##by_2018090614581394.jpg##by_20180906145813291.jpg##by_20180906145813432.jpg##by_20180906145813615.jpg##by_20180906145813761.jpg##by_20180906145813940.jpg##by_20180906145814299.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10018', '10001', '恩情无限', '一束鲜花，一片真情', '178', '9012189', '粉色康乃馨11枝，粉色多头香水百合2枝，栀子叶适量', '白色雪梨纸，米白色平面纸，粉色吊花压纹纸 银灰色缎带', '我想在阳光下满身花香，我想在阳光下沐浴清新，我想在清新里感受每一天的好时光..', '免费赠送精美贺卡！', '全国', '8', '9012189.jpg', 'by_20180612102905887.jpg##by_20180702165753637.jpg##2017471138286790317.jpg##2017471138347245013.jpg##2017471138493929477.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10019', '10001', '母爱', '为生活传情达意', '178', '9012092', '紫红色康乃馨9枝，粉色多头康乃馨10枝', '白色雪梨纸，香芋紫人造纸，粉色opp雾面纸，白蓝罗纹带花结', '不负青春年华，是对你最好的报答！', '免费赠送精美贺卡！', '全国', null, '9012092.jpg', 'by_20180611165359362.jpg##by_20180702114814450.jpg##2017471152135689074.jpg##2017471152203177737.jpg##2017471152545168597.jpg##by_20180719144139640.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10020', '10001', '感激', '美丽生活，精彩相伴', '218', '9010736', '2枝粉百合，29枝红康乃馨，适量黄莺搭配', '内层香槟色皱纸，红色平面纸，绿色缎带花结', '常怀感恩之心的人是最幸福的，常怀感激之情的生活是最甜美的！常怀感恩之情的生活是最甜美的！', '免费赠送精美贺卡！', '全国', '9', '9010736.jpg', 'by_20180607155233124.jpg##by_20180607155240691.jpg##by_20180629145442976.jpg##20154201642267694491.jpg##201512231832524011874.jpg##20154201642338988681.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10021', '10001', '温情祝福', '送人玫瑰，心有余香', '195', '9012190', '紫红色康乃馨9枝，粉色多头香水百合2枝，紫色桔梗4枝，搭配适量尤加利叶', '米白色平面纸，青灰色双面牛皮纸，银灰色缎带花结', '你如春天的风一般温暖，深深的话我们浅浅地说', '免费赠送精美贺卡！', '全国', null, '9012190.jpg', 'by_201806121028033.jpg##by_20180702165925843.jpg##20174711431587848.jpg##201747114374114047.jpg##2017471143224858096.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10022', '10001', '馨情无限', '花样人生', '246', '9012201', '戴安娜粉玫瑰11枝，红色康乃馨11支，红色石竹梅4枝，栀子叶4枝', '蓝灰色绝色纸1张，粉色OPP雾面纸1米，白绿粗条纹罗文带1米，魔力铁山灰盒（大）', '原来我一直都过得如此美满...因为有妳，我的妈妈！', '免费赠送精美贺卡！', '全国', null, '9012201.jpg', '20174251740542880694.jpg##2017425174143470111.jpg##by_20180702171014189.jpg##20153301851424563937.jpg##20174251741221099536.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10023', '10001', '一缕清香', '积极向上', '198', '9092149', '向日葵3枝，白色洋桔梗0.5扎，绿色小雏菊2枝，雪柳0.1扎', '浅绿色人造纸2.5米,白色雪梨纸1张.米白色缎带2米', '当你想我的时候，我会化作一缕温柔的清风，轻轻靠在你背后，温暖你的所有。', '免费赠送精美贺卡！', '全国', '8', '9092149.jpg', 'by_20180830135627175.jpg##by_20180911152034325.jpg##by_20180830135627559.jpg##by_20180830135627699.jpg##by_2018083014003397.jpg##by_20180911152041216.jpg##by_20180830140043107.jpg##by_20180907174325572.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10024', '10001', '深情赞美', '雅丽自然', '485', '9012325', '苏醒玫瑰29枝、红色康乃馨29枝、粉百合3枝、红色多头玫1枝', '粉色OPP雾面纸3张、灰色OPP雾面纸3张、蓝色细条纹螺纹带1.5米', '在漫长的人生里，妈妈的爱才是无可匹敌的超能力~', '免费赠送精美贺卡！', '全国', null, '9012325.jpg', '20180504121347750.jpg##20180504121348261.jpg##20180504121351180.jpg##20180509171521821.jpg##20180504121352501.jpg##20180504121353431.jpg##20180504121354453.jpg##20180504121355991.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10025', '10001', '真诚祝愿', '祝你每天开心', '288', '9012054', '粉色香水百合3枝，红色康乃馨11枝，天堂鸟2枝，跳舞兰5枝，适量香槟色桔梗，散尾葵4枝，绿叶适量', '有柄花篮一个', '一份诚挚的祝福，一份真诚的问候，愿你快乐每一天！', '免费赠送精美贺卡！', '全国', null, '9012054.jpg', 'by_20180611151752969.jpg##by_20180702105228450.jpg##20151030143014627246.jpg##20151030143059001452.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10026', '10001', '水果花篮', '温馨的祝福', '348', '9020012', '粉香水百合1枝,红掌1枝,粉玫瑰4枝,粉扶郎, 粉色康乃馨,橙子,红富士苹果,红提，哈密瓜', '藤编有柄花篮，粉色网纱+玻璃纸垫底，粉色花结一个', '满满的水果，盛开的花朵,带来温馨的祝福。', '免费赠送精美贺卡！', '全国', null, '9020012.jpg', '20115262123288607730.jpg##2011526185505286151.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10027', '10001', '暖暖的问候', '贴心又暖心', '259', '9012200', '苏醒11枝、白百合2枝、浅粉色康乃馨9枝、白色相思梅2枝', '绿色条纹纸1张、米白色平面纸1张、银灰色缎带1米、魔力铁山灰盒（大）', '暖暖的心意，让花儿传送：请你把这最诚挚的祝福带在身边，让幸福永远伴随你!', '免费赠送精美贺卡！', '全国', null, '9012200.jpg', '20176201143372730182.jpg##by_20180702170926206.jpg##2017620114349866626.jpg##20176201143586591327.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10028', '10001', '紫听您说', '聆听您', '176', '9012059', '紫红色康乃馨12枝，粉色康乃馨7枝，多头百合1枝，搭配适量石竹梅', '内层常春藤粉色压纹纸 外层深蓝色条纹纸 酒红色缎带花结', '听妈妈的话，别让她受伤想快快长大；才能保护她美丽的白发，幸福中发芽；天使的魔法，温暖中慈祥。', '免费赠送精美贺卡！', '全国', null, '9012059.jpg', 'by_20180611153606844.jpg##by_20180702105811976.jpg##20151191559203525454.jpg##20151191559253491946.jpg##by_20180719141428655.jpg##xianhua_cardstyle.jpg', '1', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10029', '10001', '抱抱我', '自然风抱桶花', '158', '9012339', '向日葵1枝，红玫瑰2枝，红色多头玫瑰2枝，红色麦秆菊2枝，尤加利叶0.1扎', '黑色或深灰色抱抱桶1个，白网1张', '爱情，是你进我退，牵着手幸福旋转的圆舞曲！', '免费赠送精美贺卡！', '全国', null, '9012339.jpg_220x240.jpg', 'by_20180917143052222.jpg##by_20180917143052426.jpg##by_20180917143052620.jpg##by_20180917143052890.jpg##by_20180917143053238.jpg##by_20180917143053429.jpg##by_20180917143053640.jpg##by_20180917143054601.jpg##by_20180920190733462.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10030', '10001', '向日葵之歌', '青春永驻', '189', '9012072', '向日葵6枝，搭配适量黄色勿忘我、黄莺', '咖啡色英文报纸,拉菲草花结', '采一束阳光，制成书签，每一天都有温暖入怀。', '免费赠送精美贺卡！', '全国', '8', '9012072.jpg', 'by_20180611161359849.jpg##by_2018070211213814.jpg##20163101827594452563.jpg##2016310182861451648.jpg##by_20180719143221167.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10031', '10001', '幸福满溢', '稳稳的幸福', '219', '9012334', '多头百合2枝，卡罗拉玫瑰8枝，红太阳花6枝，混色石竹梅0.3扎，栀子叶0.5扎', '圆型手提花篮1个', '微微的秋意带走了盛夏的酷暑，带不走我关注你的脚步，愿你快乐幸福满溢！', '免费赠送精美贺卡！', '全国', null, '9012334.jpg', 'by_20180906153016476.jpg##by_20180906153016659.jpg##by_20180906153017101.jpg##by_20180906153017286.jpg##by_20180906153017701.jpg##by_20180906153017963.jpg##by_20180906161245898.jpg##xianhua_cardstyle.jpg', '0', '2018-12-30', '10001', null, null);
INSERT INTO `fs_flower` VALUES ('10032', '10002', '「泰迪珍藏」泰迪熊永生花公仔/红', '爆款特惠！', '298', '1073181', '泰迪公仔（高16cm）；搭配厄瓜多尔进口永生红玫瑰1朵', '「泰迪珍藏」高档礼盒', '她有一颗温暖的心，足以融化我的孤独，她有甜美的笑容，令我快乐，令我想唱歌！', '免费赠送精美贺卡！', '全国', '7', '1073181.jpg', '20180427133943753.jpg##20180427133944584.jpg##2018042713394529.jpg##20180427133945557.jpg##20180427133946280.jpg##20180427133946993.jpg##20180427133947357.jpg##20180427133947817.jpg##20180427134205453.jpg##20180427133948991.jpg##20180427133949326.jpg##20180427133949723.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10033', '10002', '恋心', '火热特卖！', '288', '1073092', '厄瓜多尔进口蓝色永生玫瑰1枝,进口紫色永生玫瑰1枝,蓝紫色棒棒糖1枝', '透明玻璃罩', '化作诗化作笔化作灯写着你，爱一次梦一场思念最遥遥无期！', '免费赠送精美贺卡！', '全国', '6', '1073092.jpg', '201677173565525927.jpg##20167717453825931.jpg##2017818947537908175.jpg##2017191413288944186.jpg##by_20180607105842182.jpg##by_20180607105847935.jpg##201492183295786029.jpg##201492183424374286.jpg##by_20180607105856214.jpg##yongshenghua_cardstyle .jpg##deliver_tips .jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10034', '10002', '彩虹下的约定/花的嫁纱银项链', '畅销款特惠', '368', '1073100', '厄瓜多尔进口巨型七彩玫瑰+T400花的嫁纱S925银项链', '灰色双层高档礼盒', '生活像彩虹充满无限希望与美好，心中的那个你在我心中永远多姿多彩般的美丽，寓意着我们的爱永恒不变！', '免费赠送精美贺卡！', '全国', '9', '1073100.jpg', '##20161014913464155383.jpg##20161014915581225329.jpg##201610149169572604.jpg##20171914334826309.jpg##20171914352488931.jpg##2017191435287209720.jpg##2017191435338979205.jpg##2017191435376151462.jpg##2017191435423660037.jpg##by_20180607111031680.jpg##by_20180607111038366.jpg##201492183295786029 (1).jpg##201492183424374286 (1).jpg##by_20180607111047543.jpg##2016101492854376895.jpg##yongshenghua_cardstyle .jpg##deliver_tips .jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10035', '10002', '花漾蜜恋·淡雅紫', '疯抢特惠款', '298', '1073210', '进口紫玫瑰2朵、白玫瑰2朵、搭配紫色白色绣球、麒麟草、满天星、猫耳朵叶片', '礼盒装', '不奢求人生一路顺风顺水，只希望坎坷走尽仍有你陪', '免费赠送精美贺卡！', '全国', '6', 'by_20180809110908582.jpg', 'by_20180809110908582.jpg##by_2018080910051039.jpg##by_2018080915490748.jpg##by_20180809100510871.jpg##by_20180809100511265.jpg##by_20180809100511744.jpg##by_2018080910051278.jpg##by_20180809100512635.jpg##by_20180809100512926.jpg##by_20180809100513179.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10036', '10002', '一生一世', '爆款特惠！', '198', '1073033', ',搭配双色永生绣球，白色小星花', '心形玻璃罩+礼盒', '弱水三千只取一瓢饮，一生一世只爱你一人', '免费赠送精美贺卡！', '全国', '7', '1073033.jpg', 'by_20180821104153208.jpg##2018022616141411.jpg##by_20180821103300419.jpg##201708171612227074154142.jpg##by_20180821103308550.jpg##201708171612230605391381.jpg##201708171612231017496036.jpg##20180226161424989.jpg##by_20180821103317810.jpg##201708171612231287487452.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10037', '10002', '柔情时光－口红款', '见证柔美时光', '588', '1073174', '厄瓜多尔进口永生粉玫1朵,进口粉绣球适量、进口满天星适量；搭配专柜正品DIOR迪奥口红', '蓝色高档定制礼盒', '柔情时光，岁月如歌，我为你描绘幸福的模样。', '免费赠送精美贺卡！', '全国', '6', '20180424194649959.jpg', '20180424194649959.jpg##20180424194650736.jpg##2018042419502664.jpg##20180424194651857.jpg##20180424194652383.jpg##20180424194653141.jpg##20180424195037410.jpg##20180424194654118.jpg##20180509112343591.jpg##20180424194654550.jpg##2018042419465554.jpg##20180424194655576.jpg##20180424194656442.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10038', '10002', '海洋之恋', '德国工艺 见证永恒爱情', '999', '1073147', '，进口白玫瑰5朵,浅蓝色奥斯丁4朵，搭配进口白色蓝色绣球、海星、海螺', '玻璃罩 蓝色定制礼盒', '爱上了你，身边的世界骤然变得寂静了，这就是你带给我的一场蓝色风暴。', '免费赠送精美贺卡！', '全国', '7', '1073147.jpg', '20180226155320294.jpg##20171023112136542.jpg##20171023112526886.jpg##20171023112137299.jpg##20171023112137778.jpg##20171023112138271.jpg##by_20180808115932822.jpg##20171023112138987.jpg##by_2018080812001674.jpg##20171023112140255.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10039', '10002', '温柔清浅', '专业定制款，复古相框', '366', '1073129', ',搭配粉色、蓝色绣球，橡栗叶1片，兔尾草1枝', '蓝灰色相框，灰色礼盒', '太阳初生的时候，千万道光芒就是我心底丝丝缕缕的挂念', '免费赠送精美贺卡！', '全国', '8', '1073129.jpg', 'by_20180808152921835.jpg##by_20180808152922381.jpg##by_20180808152922693.jpg##by_20180808152923214.jpg##by_20180808152923612.jpg##by_20180808152924215.jpg##by_20180808152924574.jpg##by_20180808152925195.jpg##by_20180808152925473.jpg##by_20180808152925752.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10040', '10002', '公主的音乐水晶球·红玫瑰', '韵升专业定制音乐盒底座', '398', '1073137', ',韵升定制K9水晶音乐底座', '蓝色定制花盒', '传说，幸福是一个水晶球载着，旋转木马的浪漫迎着，七彩祥光而来', '免费赠送精美贺卡！', '全国', '6', '20180330170549462.jpg', '20180330170549462.jpg##2018033017055046.jpg##20180330185209277.jpg##20180330170550915.jpg##20180330170551586.jpg##20180330170552744.jpg##20180330171116820.jpg##20180330175244826.jpg##2018033017055495.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10041', '10002', '我如此爱你-Glam Ever星月耳钉款', '畅销星月耳钉礼盒款', '388', '1073239', '进口红绣球适量、进口松树枝适量；搭配Glam Ever星星月亮不对称玫瑰金耳钉', '蓝色高档定制礼盒', '我如此爱你，这是我存在的意义，我如此爱你，想把所有都给你。', '免费赠送精美贺卡！', '全国', '6', 'by_2018121815035427.jpg', 'by_2018121815035427.jpg##by_20181218150347493.jpg##by_20181214182041580.jpg##by_2018121815040646.jpg##by_20181214182042371.jpg##by_20181218150414577.jpg##by_20181214182917395.jpg##by_20181218150421191.jpg##by_20181214182044212.jpg##by_20181214182044357.jpg#by_20181214182044484.jpg##by_20181214182044676.jpg##by_20181214182945112.jpg##by_20181214182945351.jpg##by_20181214182945518.jpg##by_20181214182945649.jpg##by_20181214182946195.jpg##by_20181214182946785.jpg##by_20181214182947139.jpg##by_20181214182947326.jpg##by_20181214182947591.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10042', '10002', '爱的告白', '豪华定制款皮盒,限量发售', '5200', '1073166', '进口白色永生玫瑰30朵、进口粉紫色永生玫瑰65朵', '特大号蓝色手提皮盒', '愿得一人心，白首不分离。', '免费赠送精美贺卡！', '全国', '7', '20180326181020968.jpg', '20180326181020968.jpg##20180326181021613.jpg##20180326181022444.jpg##20180326181026265.jpg##20180326181026859.jpg##20180326181027368.jpg##20180326181027814.jpg##20180326181028495.jpg##20180326181028832.jpg##20180326181029231.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10043', '10002', '小公主', '热销款', '489', '1073112', '紫色玫瑰1枝，紫色奥斯丁玫瑰2枝，浅粉桃小玫瑰2枝，搭配粉色、蓝色、紫色绣球，兔尾草', '蓝色定制花盒', '初次见你，人群中独自美丽，你仿佛有一种魔力，那一刻我怦然心动。', '免费赠送精美贺卡！', '全国', '8', '1073112.jpg', '2017118171033929202.jpg##20171181710105050219.jpg##20171181710175930362.jpg##20171181710244087130.jpg##20171181710308645907.jpg##2017120104623608310.jpg##20171201046327195712.jpg##20171201046405817477.jpg##2017120104794494861.jpg##20171201047185905917.jpg##20171201047275461245.jpg##20171201047338413409.jpg##20171201047422266147.jpg##20171201047537462817.jpg##2017120104759364139.jpg##20171181712437792544.jpg##by_2018060711170010.jpg##by_2018060711170758.jpg##201492183295786029 (2).jpg##201492183424374286 (2).jpg##by_20180607111715518.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10044', '10002', '「倾世之爱」梦幻花园', '豪华定制款礼盒,限量发售', '1999', '1073159', '厄瓜多尔进口粉色永生玫瑰12朵,搭配紫色/白色绣球、紫色小满天星', '定制礼盒', '和你在一起的每一天都是晴天，和你在一起的每一刻都无限甜蜜，你是我的花漾甜心。', '免费赠送精美贺卡！', '全国', '5', '1073159.jpg', '20180124152829565.jpg##20180124152827113.jpg##20180124152827504.jpg##20180124152827969.jpg##20180124152828492.jpg##201801241528299.jpg##20180124152826398.jpg##20180124152830101.jpg##20180124152830416.jpg##20180124152830757.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10045', '10002', '爱与祝福', '送老师长辈热销', '198', '1073039', '进口粉色康乃馨1枝，紫心奥斯汀玫瑰1朵，浅粉桃色小玫瑰2朵，搭配白粉双色绣球，蓝色绣球', '爱心玻璃罩', '梦的绽放盛开着心的花蕊，美好的祝愿，梦想都成真！', '免费赠送精美贺卡！', '全国', '6', '1073039.jpg', '20180226162151254.jpg##2016428160398713336.jpg##2016428160488504596.png##2017191417253057300.png##by_2018060710575441.jpg##by_20180607105800486.jpg##201492183295786029 (3).jpg##201492183424374286 (3).jpg##by_2018060710580999.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10046', '10002', '「倾世之爱」永生玫瑰熊/定制款', '奢华定制款', '19999', '1073158', '厄瓜多尔进口红色永生玫瑰', '特大号亚克力定制礼盒', '爱的岁月里，我想像小熊一样给你拥抱，每一个拥抱都是我想给你陪伴、呵护与温暖。', '免费赠送精美贺卡！', '全国', '5', '1073158.jpg', '20180112102358432.jpg##20180112101803650.jpg##20180112101804230.jpg##20180112101806864.jpg##20180112101807507.jpg##20180112101808499.jpg##20180112101809453.jpg##20180112101809817.jpg##20180112101810219.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10047', '10002', '我如此爱你-项链款', '礼盒套装 双重惊喜', '388', '1073189', '进口红色永生玫瑰1朵、红色小果子2颗、进口红绣球适量、进口松树枝适量S925银锁骨项链', '蓝色高档定制礼盒', '我如此爱你，这是我存在的意义，我如此爱你，想把所有都给你。', '免费赠送精美贺卡！', '全国', '6', '1073189.jpg', '20180510115910149.jpg##20180510115911662.jpg##20180510115912368.jpg##20180510115913379.jpg##20180510115913940.jpg##20180510133731853.jpg##20180510134153861.jpg##20180510133931865.jpg##20180510133932636.jpg##20180510133933615.jpg##20180510134210473.jpg##20180510120032191.jpg##20180510120032658.jpg##20180510120033165.jpg##20180510120033676.jpg##yongshenghua_cardstyle.jpg##deliver_tips.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10048', '10003', '宝石旋转木马/蓝', '造型精致，音质悦耳', '158', '1065004', '三只小木马，顶部为音乐发条', '采用精美纸盒包装', '有人说旋转木马是见证两个相爱的人的爱情游戏，他们的爱情就会天长地久.', '免费赠送精美贺卡！', '全国', '7', '1065004.jpg_220x240.jpg', '2016215958296676333.jpg##20127121632461995608.jpg##2012712163364611453.jpg##20127121633417214114.jpg##2012712163418134219.jpg##20127121634341685931.jpg##20127121634491575519.jpg##20127121634174897784.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10049', '10003', '心形3D水晶内雕爱在心里', '升级版带音乐底座', '169', '1071007', '七彩旋转水晶内雕。', '高档礼盒', 'USB七彩发光水晶，出口欧美的品质，带给你晶莹剔透的感觉', '免费赠送精美贺卡！', '全国', '9', '1064035.jpg_220x240.jpg', '20134191135515006823.jpg##2013419113636823413.jpg##20134191136165967578.jpg##20134191136251276965.jpg##20134191136533133105.jpg##20134101915526890979.jpg##2013410191651669452.jpg##20177031859198849017.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10050', '10003', '十八音粉水晶钢琴', '八音琴声', '258', '1064035', '内置18音精品机芯，机芯纯铜镀金制作，音质和质量都属上乘。', '采用高档礼盒', '浪漫永恒，经典重温。只愿能一辈子这样的静静地聆听：一个个跳动的音符诉说着一份份淳淳的爱意。', '免费赠送精美贺卡！', '全国', '6', '2016126162872750232.jpg', '2016126162872750232.jpg##2014919143432711306.jpg##20149191434421947406.jpg##20161261628186170276.jpg##2014919143515063128.jpg##20161111181447222079.jpg##20161261628287220019.jpg##201112291145576781939.jpg##20121121117156454684.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10051', '10003', 'Hello Kitty转运水晶化妆镜', '转运水晶化妆镜，方便携带', '128', '1070060', '颜色： 银色 \r\n尺寸： 65x65x19mm\r\n重量： 159g左', '手提袋、绸缎礼盒、绒布袋、擦镜布、质保卡', '请把我带在身边，让我陪着你哭，陪着你笑......', '免费赠送精美贺卡！', '全国', '9', '201707111836034911214472.jpg', '201707111836044614158350.jpg##201707111836030340763180.jpg##201707111836030340763180 (1).jpg##201707111836057404968236.jpg##201707111836036653537856.jpg##201707111836030830226518.jpg##201707111836050914867083.jpg##201707111836029630666943.jpg##201707111836034911214472.jpg##201707111836035391437972.jpg##201707111836034441903499.jpg##201707111836036181731060.jpg##201707111836040974909445.jpg##201707111836039553713712.jpg##201707111836047244559243.jpg##201707111836054244125000.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10052', '10003', '奢悦之美巧克力礼盒', '始于颜值 忠于口感', '158', '1201003', '品牌: CHORO/巧罗\r\n巧罗奢悦之美情人节巧克力礼物 纯可可脂黑巧克力礼盒装', '礼盒装', '丝丝柔滑在你身边', '免费赠送精美贺卡！', '全国', '7', '1204042.jpg_220x240.jpg', '2016419187121858554.jpg##201641918787690097.jpg##2016419187164523837.jpg##201641918727684115.jpg##2016419187312704501.jpg##2016419187364454074.jpg##2016419187404315097.jpg##2016419187446922702.jpg##2016419187526692538.jpg##2017630171521173388.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10053', '10003', '酸甜莓小熊暖水袋', '暖冬热销-送爱就送温暖\r\n\r\n', '69', '1087023', '品牌: SOLOVE\r\n流行元素: 马卡龙色\r\n颜色：粉色\r\n热水袋类型: 冲水热水袋', '纸盒', '梦幻雪糕暖水袋，寒潮中的法式温暖', '免费赠送精美贺卡！', '全国', '5', '1087023.jpg_220x240.jpg', 'by_20181221143737244.jpg##by_20181221143736578.jpg##by_20181221143736849.jpg##by_2018122114373742.jpg##by_20181221143737442.jpg##by_20181221143737618.jpg##by_20181221143737780.jpg##by_20181221143737955.jpg##by_20181221143738557.jpg##by_20181221143738835.jpg##by_2018122114373920.jpg##by_2018122118541986.jpg##by_20181221143739283.jpg##by_20181221143739417.jpg##by_20181221143739660.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10054', '10003', '智能香薰音响', '下单赠5ML的精油一瓶\r\n\r\n', '349', '1088004', 'emoi基本生活香薰机精油音响灯喷雾加湿器', '礼盒装', '香香进你心', '免费赠送精美贺卡', '全国', '6', '1088004.jpg_220x240.jpg', 'by_20180727140204580.jpg##by_20180727140204866.jpg##by_20180727140205797.jpg##by_20180727140206131.jpg##by_20180727140206736.jpg##by_20180727140206988.jpg##by_20180727140207269.jpg##by_20180727140207746.jpg##by_20180727140208501.jpg##by_20180727140208910.jpg##by_20180727140209223.jpg##by_20180727140210150.jpg##by_20180727140217569.jpg##by_20180727140218121.jpg##by_20180727140219214.jpg##by_20180727140219545.jpg##by_20180727140220244.jpg##by_20180727140220582.jpg##by_20180727140221194.jpg##by_20180727140222842.jpg##by_2018072714023336.jpg##by_20180727140233654.jpg##by_20180727140233853.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10056', '10003', 'LED灯水晶球音乐盒', '璀璨夺目，五彩纷呈', '259', '1065045', 'WAS精品120mm水球音乐盒', '精美纸盒包装', '在这个特别的日子 我的心... 还有我们大家... 都祝你：“节日快乐”', '免费赠送精美贺卡！', '全国', '9', 'by_2018121410500764.jpg', 'by_2018121410500764.jpg##by_20181214105007227.jpg##by_20181214105007372.jpg##by_20181214105007491.jpg##by_20181214105007640.jpg##by_20181214105007928.jpg##by_20181214105007775.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10057', '10003', '小花抱枕', '萌宠治愈系，满满幸福感', '49', '1062053', '【填充】：PP棉', '彩色透明塑料袋包装，蝴蝶结束扎、赠送精美留言贺卡及绿色无纺布袋。', '简洁的外型，温馨的色彩，柔和的触感，带给您闺中好友般的为问候和至爱。', '免费赠送精美贺卡！', '全国', '8', '20167211540518141360.jpg', '20167211540518141360.jpg##20163171511426602862.jpg##2016721154135449710.jpg##20163171511584328143.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10058', '10003', '生日快乐', '手工彩绘，音质清脆悦耳', '138', '1065032', 'WAS精品音乐盒摆饰，高档树脂材质，内置日本sankyo机芯', '精美纸盒包装', '在这个特别的日子 我的心... 还有我们大家... 都祝你：“生日快乐”', '免费赠送精美贺卡！', '全国', '7', '2012627184174222262.jpg', '2012627183545202792.jpg##201262718433850924.jpg##2012627184321894809.jpg##2012627184426844150.jpg##20126271845228781.jpg##201262718525644442.jpg##20126271459257795566.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10060', '10003', '公仔创意花束-小狗先生', '送儿童、小孩定制款', '199', '1073198', '棉花3枝、灰色冰淇淋装饰5个、手工小狗2个、湖蓝色羊绒蝴蝶结3个、水晶草适量', '长形魔力铁山灰高档礼盒', '萌萌哒的卡通公仔+棉花和水晶草，搭配设计师定制的精美礼盒，给她满满的爱，满满的惊喜与感动！', '免费赠送精美贺卡！', '全国', '8', '20180530142254300.jpg', '20180530142254300.jpg##2018053014225521.jpg##20180530142255577.jpg##20180530142256547.jpg##20180530142257117.jpg##20180530142258567.jpg##20180530142259165.jpg##2018053014230052.jpg##20180530142300560.jpg##2018053014230169.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10061', '10003', '三十音首饰音乐盒/蓝', '原木材料，进口树皮', '898', '1064012', '原木材制，进口树皮，采用意大利传统手工帖皮刻花工艺，内置30音精品机芯。兼具首饰盒功能。', '高档礼盒', '只愿能一辈子 这样的静静地聆听：一个个跳动的音符 诉说着一份份 淳淳的爱意', '免费赠送精美贺卡！', '全国', '7', '2012726161313490298.jpg', '2012726161313490298.jpg##2012726169308112658.jpg##2012726161244723376.jpg##20127261613478364932.jpg##20127261612511318850.jpg##20127261615208658816.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10062', '10003', '夏之慕／荷', '可爱动人', '129', '6010160', '多肉植物*22棵 彩色 鲜活植物', '普通纸盒', '每天都能浇灌一杯水', '免费赠送精美贺卡！', '全国', '8', 'by_2018081714055516.jpg', 'by_20180817140555645.jpg##by_20180817140556390.jpg##by_20180817140556798.jpg##by_20180817140558577.jpg##by_20180817140559520.jpg##by_20180817140600261.jpg\r\nby_20180817140555645.jpg##by_20180817140556390.jpg##by_20180817140556798.jpg##by_20180817140558577.jpg##by_20180817140559520.jpg##by_20180817140600261.jpg\r\nby_20180817140555645.jpg##by_20180817140556390.jpg##by_20180817140556798.jpg##by_20180817140558577.jpg##by_20180817140559520.jpg##by_20180817140600261.jpg', null, '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10063', '10003', 'Glam Ever星星乐园金色半星耳环', '甜美星星', '329', '1076037', '材质: 合金/镀银/镀金', '精美礼盒', 'Glam Ever星星乐园金色钨五角星简约大耳钉', '免费赠送精美贺卡！', '全国', '9', 'by_2018080110201856.jpg', 'by_2018080110201856.jpg##by_20180801102018661.jpg##by_20180801102019138.jpg##by_20180801102019505.jpg##by_20180801102020471.jpg##by_20180801102021311.jpg##by_2018080110202277.jpg##by_20180801102022539.jpg', '0', '2018-12-30', '10002', null, null);
INSERT INTO `fs_flower` VALUES ('10064', '10003', '简约蓝调花瓶', '送小女生首选', '19', '1068102', '玻璃', '普通包装', '最清澈的颜色便是一眼，像是水珠挂在瓶身上，简单剔透！', '免费赠送精美贺卡！', '全国', '7', 'by_20180628183851253.jpg', 'by_20180628183851253.jpg##by_20180628183147656.jpg##by_2018062818314877.jpg##by_20180628183148796.jpg##by_201806281832071.jpg##by_20180628183859289.jpg', '0', '2018-12-30', '10002', null, null);

-- ----------------------------
-- Table structure for `fs_kind`
-- ----------------------------
DROP TABLE IF EXISTS `fs_kind`;
CREATE TABLE `fs_kind` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '类别ID',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '类别名',
  `disc` varchar(40) COLLATE utf8_unicode_ci NOT NULL COMMENT '类别描述',
  `crtTime` date NOT NULL COMMENT '录入日期',
  `crtBy` int(11) NOT NULL COMMENT '录入人',
  `mdfTime` datetime DEFAULT NULL COMMENT '修改时间',
  `mdfBy` int(11) DEFAULT NULL COMMENT '修改人',
  `picture` varchar(20) COLLATE utf8_unicode_ci NOT NULL DEFAULT '1.png',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10004 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of fs_kind
-- ----------------------------
INSERT INTO `fs_kind` VALUES ('10000', '爱情鲜花', '送·让你怦然心动的人', '2018-12-29', '10001', null, null, '1.png');
INSERT INTO `fs_kind` VALUES ('10001', '送长辈鲜花', '赠·父母/恩师/长辈', '2018-12-29', '10001', null, null, '2.png');
INSERT INTO `fs_kind` VALUES ('10002', '永生花', '许·她一生承诺', '2018-12-29', '10001', null, null, '3.png');
INSERT INTO `fs_kind` VALUES ('10003', '礼品', '给她·最美好的礼物', '2018-12-29', '10001', null, null, '4.png');

-- ----------------------------
-- Table structure for `fs_order`
-- ----------------------------
DROP TABLE IF EXISTS `fs_order`;
CREATE TABLE `fs_order` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '订单号ID',
  `userid` int(11) NOT NULL COMMENT '外键：fs_user.id用户ID',
  `flowerid` int(11) NOT NULL COMMENT '外键：fs_flower.id鲜花ID',
  `siteid` int(11) NOT NULL COMMENT '外键：fs_site.id收货地址ID',
  `adminid` int(11) DEFAULT NULL COMMENT '外键：fs_user.id审批人ID',
  `number` int(5) NOT NULL COMMENT '购买数量',
  `price` float(5,2) NOT NULL COMMENT '总金额',
  `crtTime` date NOT NULL COMMENT '创建日期',
  `crtBy` int(11) NOT NULL COMMENT '创建人',
  `payTime` datetime DEFAULT NULL COMMENT '支付时间',
  `outTime` datetime DEFAULT NULL COMMENT '发货时间',
  `recTime` datetime DEFAULT NULL COMMENT '收货时间',
  `scsTime` datetime DEFAULT NULL COMMENT '结单时间',
  `mdfTime` datetime DEFAULT NULL COMMENT '修改时间',
  `mdfBy` int(11) DEFAULT NULL COMMENT '修改人',
  PRIMARY KEY (`id`),
  KEY `userid` (`userid`),
  KEY `flowerid` (`flowerid`),
  KEY `siteid` (`siteid`),
  KEY `adminid` (`adminid`),
  CONSTRAINT `fs_order_ibfk_1` FOREIGN KEY (`userid`) REFERENCES `fs_user` (`id`),
  CONSTRAINT `fs_order_ibfk_2` FOREIGN KEY (`flowerid`) REFERENCES `fs_flower` (`id`),
  CONSTRAINT `fs_order_ibfk_3` FOREIGN KEY (`siteid`) REFERENCES `fs_site` (`id`),
  CONSTRAINT `fs_order_ibfk_4` FOREIGN KEY (`adminid`) REFERENCES `fs_user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of fs_order
-- ----------------------------
INSERT INTO `fs_order` VALUES ('2', '10005', '10002', '1', null, '1', '199.00', '2019-01-03', '10005', '2019-01-03 21:16:48', '2019-01-04 04:44:44', null, null, null, null);
INSERT INTO `fs_order` VALUES ('3', '10005', '10002', '1', null, '1', '199.00', '2019-01-03', '10005', '2019-01-03 21:17:02', '2019-01-04 04:44:44', null, null, null, null);
INSERT INTO `fs_order` VALUES ('4', '10005', '10023', '1', null, '1', '158.00', '2019-01-04', '10005', '2019-01-04 04:29:13', '2019-01-04 04:44:44', null, null, null, null);

-- ----------------------------
-- Table structure for `fs_site`
-- ----------------------------
DROP TABLE IF EXISTS `fs_site`;
CREATE TABLE `fs_site` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '收货地址ID',
  `userid` int(11) NOT NULL COMMENT '外键：fs_user.id用户ID',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '收货人',
  `phone` varchar(11) COLLATE utf8_unicode_ci NOT NULL COMMENT '收货手机号',
  `site` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '收货地址',
  `crtTime` date NOT NULL COMMENT '录入日期',
  `crtBy` int(11) NOT NULL COMMENT '录入人',
  `mdfTime` datetime DEFAULT NULL COMMENT '修改时间',
  `mdfBy` int(11) DEFAULT NULL COMMENT '修改人',
  PRIMARY KEY (`id`),
  KEY `userid` (`userid`),
  CONSTRAINT `fs_site_ibfk_1` FOREIGN KEY (`userid`) REFERENCES `fs_user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of fs_site
-- ----------------------------
INSERT INTO `fs_site` VALUES ('1', '10005', '张三', '13500000000', '大连工业大学', '2019-01-03', '10005', '2019-01-03 20:34:06', '10005');

-- ----------------------------
-- Table structure for `fs_user`
-- ----------------------------
DROP TABLE IF EXISTS `fs_user`;
CREATE TABLE `fs_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '用户昵称',
  `phone` varchar(11) COLLATE utf8_unicode_ci NOT NULL COMMENT '登录手机号，唯一',
  `password` varchar(35) COLLATE utf8_unicode_ci NOT NULL COMMENT 'md5密码',
  `isAdmin` int(1) NOT NULL COMMENT '0用户，1管理员',
  `crtTime` date NOT NULL COMMENT '注册日期',
  `crtBy` int(11) DEFAULT NULL COMMENT '注册方式',
  `mdfTime` datetime DEFAULT NULL COMMENT '修改时间',
  `mdfBy` int(11) DEFAULT NULL COMMENT '修改人',
  PRIMARY KEY (`id`),
  UNIQUE KEY `phone` (`phone`)
) ENGINE=InnoDB AUTO_INCREMENT=10017 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of fs_user
-- ----------------------------
INSERT INTO `fs_user` VALUES ('10000', '吴俊', '15500000000', '4297f44b13955235245b2497399d7a93', '1', '2018-12-29', '10000', '2019-01-03 14:40:43', null);
INSERT INTO `fs_user` VALUES ('10001', '谭诗训', '16600000000', '4297f44b13955235245b2497399d7a93', '1', '2018-12-29', '10001', null, null);
INSERT INTO `fs_user` VALUES ('10002', '张婷', '18800000000', '4297f44b13955235245b2497399d7a93', '1', '2018-12-29', '10002', null, null);
INSERT INTO `fs_user` VALUES ('10003', '新会员', '13512341234', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10005', '张三', '13500000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', '2019-01-04 14:09:21', '10005');
INSERT INTO `fs_user` VALUES ('10006', '新会员', '13600000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10007', '新会员', '13700000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10008', '新会员', '13800000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10009', '新会员', '13900000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10010', '新会员', '15100000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10011', '新会员', '15600000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10012', '新会员', '15612341234', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10013', '新会员', '15612341235', '4297f44b13955235245b2497399d7a93', '0', '2019-01-03', '10000', null, null);
INSERT INTO `fs_user` VALUES ('10014', '新会员', '18600000000', '4297f44b13955235245b2497399d7a93', '0', '2019-01-04', '10000', null, null);
